{
  "id": "中国茶叶分类",
  "children": [
    {
      "id": "绿茶",
      "children": [
        {
          "id": "西湖龙井",
          "value": 3938
        },
        {
          "id": "碧螺春",
          "value": 3812
        },
        {
          "id": "黄山毛峰",
          "value": 6714
        },
        {
          "id": "信阳毛尖",
          "value": 743
        },
        {
          "id": "六安瓜片",
          "value": 5219
        },
        {
          "id": "太平猴魁",
          "value": 3444
        }
      ]
    },
    {
      "id": "红茶",
      "children": [
        {
          "id": "祁门红茶",
          "value": 3534
        },
        {
          "id": "正山小种",
          "value": 5731
        },
        {
          "id": "滇红工夫",
          "value": 7840
        },
        {
          "id": "金骏眉",
          "value": 5914
        },
        {
          "id": "川红工夫",
          "value": 3416
        }
      ]
    },
    {
      "id": "白茶",
      "children": [
        {
          "id": "白毫银针",
          "value": 1983
        },
        {
          "id": "白牡丹",
          "value": 2047
        },
        {
          "id": "寿眉",
          "value": 1375
        },
        {
          "id": "贡眉",
          "value": 8746
        }
      ]
    },
    {
      "id": "黄茶",
      "children": [
        {
          "id": "君山银针",
          "value": 2202
        },
        {
          "id": "蒙顶黄芽",
          "value": 1675
        },
        {
          "id": "霍山黄芽",
          "value": 2042
        },
        {
          "id": "温州黄汤",
          "value": 1382
        }
      ]
    },
    {
      "id": "乌龙茶",
      "children": [
        {
          "id": "铁观音（清香型）",
          "value": 7074
        },
        {
          "id": "铁观音（浓香型）",
          "value": 5842
        },
        {
          "id": "大红袍",
          "value": 1983
        },
        {
          "id": "肉桂",
          "value": 2047
        },
        {
          "id": "水仙",
          "value": 1375
        },
        {
          "id": "凤凰单丛",
          "value": 8746
        }
      ]
    },
    {
      "id": "黑茶",
      "children": [
        {
          "id": "普洱熟茶",
          "value": 10498
        },
        {
          "id": "普洱生茶",
          "value": 2822
        },
        {
          "id": "安化黑茶",
          "value": 9983
        },
        {
          "id": "六堡茶",
          "value": 1681
        },
        {
          "id": "泾渭茯茶",
          "value": 2213
        }
      ]
    }
  ]
}
